//Деякі загальні математичні обчислення програміст може реалізувати
// у своїй програмі за допомогою функцій стандартної математичної бібліотеки math мови С.
// Напишіть програму, яка перевіряє виклики функцій математичної бібліотеки та виводить
// результати у вигляді таблиці з такими фіксованими рядком та стовпцем:
//
//функція               призначення                        приклад
//
//sqrt(x)
//
//exp(x)...
#include <stdio.h>
#include <math.h>

int main() {
    float x;
    float y;
    printf("введіть x");
    scanf("%f",&x);
    printf("введіть y");
    scanf("%f",&y);

    printf("Функція           Призначення           Приклад\n");
    printf("-------------------------------------------------\n");
    printf("sqrt(x)           Корінь квадратний     sqrt(%.2f) = %.2f\n", x, sqrt(x));
    printf("exp(x)            Експонента            exp(%.2f) = %.2f\n", x, exp(x));
    printf("log(x)            Натуральний логарифм  log(%.2f) = %.2f\n", x, log(x));
    printf("fabs(x)           Модуль числа          fabs(%.2f) = %.2f\n", x, fabs(x));
    printf("pow(x, y)         Піднесення до ступеня pow(%.2f, %.2f) = %.2f\n", x, y, pow(x, y));
    printf("sin(x)            Синус                 sin(%.2f) = %.2f\n", x, sin(x));
    printf("cos(x)            Косинус               cos(%.2f) = %.2f\n", x, cos(x));
    printf("tan(x)            Тангенс               tan(%.2f) = %.2f\n", x, tan(x));
    printf("fmod(x)           Остача від ділення    fmod(%.2f, %.2f) = %.2f\n", x, y, fmod(x, y));

    return 0;
}
