
//21. Написати програми за своїми варіантами, які реалізують
// алгоритми роботи з прямокутними або квадратними матрицями за допомогою двомірних масивів.
//Зробити можливість повторювати виконання  програми без перезапуску
// (використати структуру повторення).
//Обробку інформації (введення, виведення масиву, перетворення)
// оформити у вигляді окремих функцій.
//
// Реалізувати алгоритм, який серед елементів головної діагоналі матриці
// розміром nxn  знаходить однакові елементи та збільшує їх в 2 рази.
// Значення n  визначається користувачем.



#include <stdio.h>

void input(int n,int arr[n][n])
{
    for(int i=0;i<n;i++)
    {
        for(int j=0;j<n;j++)
        {
            scanf("%d",&arr[i][j]);
        }
    }
}
void print(int n,int arr[n][n])
{
    for(int i=0;i<n;i++)
    {
        for(int j=0;j<n;j++)
        {
            printf("%d\t",arr[i][j]);
        }
        printf("\n");
    }
}
void process(int n,int arr[n][n])
{
    for (int i=0;i<n-1;i++)
    {

        if(arr[i][i] == arr[i+1][i+1])
        {
            arr[i][i]*=2;
            arr[i+1][i+1]*=2;
        }


    }
}
int main()
{
    int n;
    printf("Введить розмірнисть масиву n*n");
    scanf("%d",&n);
    int arr[n][n];

    input(n,arr);

    printf("Вивід матриці\n");
    print(n,arr);

    printf("Помножена матриця\n");
    process(n, arr);

    print(n,arr);

    return 0;
}
