//21.	Використати одномірний масив цілих чисел,
// який заповнити довільними цілими числами. Знайти номери тих елементів масиву, які більше 10,
// і кількість таких елементів. Знайдені номери виводити в порядку їх зростання.



#include <stdio.h>



int main() {

int n;

    printf("Введіть розмір масиву:");
    scanf("%d", &n);

    int  arr[n];
    int cnt=0;
    for (int i = 0;i<n;i++)
    {

        printf("Введить число: ");
        scanf("%d",& arr[i]);

    }
    for (int i = 0;i<n;i++)
    {
        if(arr[i]>10)
        {
            printf("Номер елемента який більше 10:[%d]\n",i);
            cnt+=1;
        }
    }


    printf("Кількість елементів який більше 10:%d", cnt);

    return 0;
}
