//№1
//Написати програму відповідно до такого алгоритму.
//Фірма продає пʼять різних видів товарів:
//Номер товару Ціна за одиницю товару
//1 - 29 грн. 80 коп.
//2 - 45 грн. 50 коп.
//3 - 9 грн. 98 коп.
//4 - 44 грн. 90 коп.
//5 - 67 грн. 80 коп.
//Програма повинна забезпечити виведення таблиці на екран та реалізувати механізм,
// що забезпечує продавцю виконати такі дії:
//1) ввести номер товару:
//2) кількість товару, що продано покупцю;
//3) вивести на екран, який товар проданий,
// кількість проданого товару та на яку суму проданий цей товар.




#include <stdio.h>
int main() {
    int t, quantity;

    printf("введіть номер товару(1-5):");
    scanf("%d", &t);
    printf("кількість проданого товару:");
    scanf("%d", &quantity);

    switch (t)
    {
        case 1:
            printf("товар: %d\nкількість проданого товару: %d\n"
                   "на яку суму проданий товар: %2.2f гр" ,t,quantity,quantity*29.80);
            break;
        case 2:
            printf("товар: %d\nкількість проданого товару: %d\n"
                   "на яку суму проданий товар: %2.2f гр" ,t,quantity, quantity*45.50);
            break;

        case 3:
            printf("товар: %d\nкількість проданого товару: %d\n"
                   "на яку суму проданий товар: %2.2f гр" ,t,quantity, quantity*9.98);
            break;
        case 4:
            printf("товар: %d\nкількість проданого товару: %d\n"
                   "на яку суму проданий товар: %2.2f гр" ,t,quantity, quantity*44.90);
            break;
        case 5:
            printf("товар: %d\nкількість проданого товару: %d\n"
                   "на яку суму проданий товар: %2.2f гр" ,t,quantity, quantity*67.80);
            break;
        default:
            printf("ERROR!");

    }

    return 0;
}